app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit # show edit form
    @article = Article.find_by_id(params[:id])

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "My edit"], ["description", "My article description"], ["updated_at", "2021-03-18 19:17:53.667177"], ["id", 1]]
---
  def update # update the instance with form info
    @article = Article.find_by_id(params[:id])
    @article.update(title: params[:article][:title], description: params[:article][:description])